alacritty
arandr
aspell
aspell-en
betterlockscreen
bitwarden
blueman
brightnessctl
calcurse
cronie
darktable
docker
docker-compose
downgrade
dunst
emacs
fd
file-roller
filezilla
flameshot
font-manager
galculator
gimp
git
gnome-multi-writer
google-chrome
gpick
graphviz
inetutils
kitty
lightdm
lightdm-gtk-greeter
lightdm-gtk-greeter-settings
lsof
lxappearance
lxpolkit
lxqt-powermanagement
maim
neovim
nitrogen
nodejs
noto-fonts-emoji
npm
openvpn
p7zip
pcmanfm
pulseaudio-alsa
qbittorrent
qutebrowser
ranger
ripgrep
rofi
simplescreenrecorder-qt6-git
speedtest-cli
spotify
stow
syncthing-gtk
telegram-desktop
tidy
trayer
tree
tree-sitter
ttf-sourcecodepro-nerd
ttf-ubuntu-font-family
ueberzug
unclutter
upower
vimiv
vlc
whois
xclip
xmobar
xmonad
xmonad-contrib
zathura
zathura-pdf-poppler
zsh
zsh-autosuggestions
zsh-completions
zsh-syntax-highlighting
