alacritty
arandr
betterlockscreen
blueman
bitwarden
brightnessctl
calcurse
darktable
docker
docker-compose
downgrade
dropbox
dunst
emacs
file-roller
font-manager
flameshot
galculator
google-chrome
gimp
git
gnome-multi-writer
gpick
kitty
lightdm
lightdm-gtk-greeter
lightdm-gtk-greeter-settings
lsof
lxqt-powermanagement
nitrogen
npm
neovim
nwg-look
openvpn
p7zip
pcmanfm
pulseaudio-alsa
qutebrowser
qbittorrent
ranger
rofi
simplescreenrecorder
spotify
stow
telegram-desktop
trayer
tree
ueberzug
unclutter
upower
vimiv
vlc
xmobar
xmonad
xmonad-contrib
zathura
zathura-pdf-poppler
zsh
zsh-completions
zsh-syntax-highlighting
zsh-autosuggestions
